app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
<<<<<<< HEAD
    @student = Student.find_by_id(params[:id])
=======
    @student = SchoolClass.find_by_id(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-08-23 13:28:18.402829"], ["id", 1]]
---
  def update
    @student = Student.find_by_id(params[:id])
    @student.update(student_params)